Autodesk.Revit.DB.IExportContext2DProxy.OnFaceSilhouette2D(Autodesk.Revit.DB.FaceSilhouetteNode)
This method is called when a Face silhouette is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
Note: if the export is performed for the view in non-Wireframe display style
this method will be called regardless of whether the object will be eventially output,
i.e. even if it's occluded by another element.
node:
An output node that represents a Face silhouette.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this face silhouette, or otherwise return RenderNodeAction.Skip.
Note: if the export is performed for the view in non-Wireframe display style
tesselated geometry will be output regardless of the return value.
Since:
2020

Autodesk.Revit.DB.IExportContext2DProxy.OnFaceEdge2D(Autodesk.Revit.DB.FaceEdgeNode)
This method is called when a Face edge is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
Note: if the export is performed for the view in non-Wireframe display style
this method will be called regardless of whether the object will be eventially output,
i.e. even if it's occluded by another element.
node:
An output node that represents a Face edge.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this face edge, or otherwise return RenderNodeAction.Skip.
Note: if the export is performed for the view in non-Wireframe display style
tesselated geometry will be output regardless of the return value.
Since:
2020

Autodesk.Revit.DB.IExportContext2DProxy.OnElementEnd2D(Autodesk.Revit.DB.ElementNode)
This method marks the end of an element being exported.
Remarks:
For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets.
Therefore the argument to this method is ElementNode that has both element ID and the host document.
node:
An output node that represents an element.
Since:
2020

Autodesk.Revit.DB.IExportContext2DProxy.OnElementBegin2D(Autodesk.Revit.DB.ElementNode)
This method marks the beginning of an element to be exported.
Remarks:
For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets.
Therefore the argument to this method is ElementNode that has both element ID and the host document.
node:
Node representing the element that is about to start being exported. Contains element ID and document.
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this element,
or return RenderNodeAction.Proceed otherwise.
Since:
2020